big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
#include <Arduino.h>
#include <FastLED.h>
#include <SPI.h>
#include "ESP32_fft.h"
#include <EEPROM.h>

#define EEPROM_size 3

#define VSPI_MISO 19
#define VSPI_MOSI 23
#define VSPI_SCLK 18
#define VSPI_CS   5

#define FFT_N 512 //FFT SAMPLES to be used
#define SAMPLEFREQ 40000 //time taken to obtain 512 samples at 40,000Hz
#define noise_filter 

//touch pins to use with the ESP32
#define touch1 32
#define touch2 33
#define touch3 27

static const uint8_t max_brightness=190;
static const uint8_t min_brightness=2;

static TaskHandle_t normal_vis_handle, ISR_handler_handle, spi_handle, fill_white_lights_handle, fft_handle, wave_vis_handle;
static TimerHandle_t touch1_timer, touch2_timer, touch3_timer, hue_timer, mapping_decay_timer, peak_decay_timer, wave_frame_timer, mode_animation_timer, mode_animation_random_timer;

float fft_input_ch0[FFT_N]; //input array for fft calculations
float fft_input_ch1[FFT_N];
float fft_output_ch0[FFT_N];// fft output array
float fft_output_ch1[FFT_N];

//struct to hold data to send to the spi output queue
typedef struct spi_out{
  float spi_out_ch0[FFT_N];
  float spi_out_ch1[FFT_N];
}spi_out;

//struct to hold data to send to another task that will use the fft output
typedef struct fft_out{
  uint_fast16_t post_process[2][10];
}fft_out;

// create fft classes
ESP_fft fft_ch0(FFT_N, SAMPLEFREQ, FFT_REAL, FFT_FORWARD, fft_input_ch0, fft_output_ch0);
ESP_fft fft_ch1(FFT_N, SAMPLEFREQ, FFT_REAL, FFT_FORWARD, fft_input_ch1, fft_output_ch1);

// choose the specific frequencies to analyze
uint16_t bands[10] = {1,3,6,13,20,26,32,40,52,64}; //78.125, 234.375, 468.75, 1015.625, 1562.5, 2031.25, 2500, 3125, 4062.5, 5000 (Frequencies to analyse)

//maximum map map value for the fft output
uint16_t mapping_max =2000;

static const int spiClk =8000000; //8 MHZ SPI CLock

SPIClass *vspi = NULL;

// create arrays to hold the received spi data
static uint8_t received_ch0[2];
static uint8_t received_ch1[2];

//create queue to hold fft input and output for intertask communication
QueueHandle_t fft_in_queue, fft_out_queue;

//define the pins that will be used to interface the components of the project
const uint8_t right_leds=16;
const uint8_t left_leds=17;
const uint8_t num_leds=60;
const uint8_t relay_pin=12;

// create global flags that will be used to control functions
static bool touch1_active = false;
static bool touch2_active = false;
static bool touch3_active = false;
static bool touch1_letgo = true;
static bool touch2_letgo = true;
static bool touch3_letgo = true;
static bool short_press1 = true;
static bool short_press2 = true;
static bool short_press3 = true;
static bool timer1_started = false;
static bool timer2_started = false;
static bool timer3_started = false;
static bool long_press1 = true;
static bool long_press2 = true;
static bool long_press3 = true;

static bool brightness_control_flag = false;
static bool mode_animation_started = false;

static volatile bool shift_frame = false;
static bool wave_frame_timer_flag = false;
static bool wave_frame_timer_period_change_flag = false;
static bool mode_animation_random_timer_flag = false;
static bool mode_animation_random_on = true;
static bool initial_clear = false;

static bool hue_timer_change_peiod_flag = false;

// variables to hold the duration of pin that was touched
static int touch1_time, touch2_time, touch3_time;

static uint8_t hue = 0;
static uint8_t brightness = 60;
static uint8_t column_height[2][10], peak_column_height[2][10];
static uint8_t palette_index = 0;
static uint8_t current_mode = 0;

static uint8_t mode1_column_index = 0;

//create the structure that will be be used to address the leds
static CRGB leds[2][num_leds];

/* To modify the color palettes to use your own palettes,
  Modifiy the palette index increment in the "touch_func" task 
  to add or decrease the palettes. Modify the palettes declaration section
  to customize your palettes.
*/
DEFINE_GRADIENT_PALETTE(heat_colors){
  0,  0,0,255,
  127,255,0,0,
  255,255,255,40
};

static CRGBPalette16 palettes_arr[] ={
  //standard rainbow palette
  RainbowColors_p,
  //custom palette 0
  CRGBPalette16(CRGB(255, 0, 84),
                CRGB(255, 0, 84),
                CRGB(60, 60, 255),
                CRGB(60, 60, 255),

                CRGB(75, 203, 246),
                CRGB(75, 203, 246),
                CRGB(255, 245, 50),
                CRGB(255, 245, 50),
                
                CRGB(255, 245, 50),
                CRGB(255, 245, 50),
                CRGB(75, 203, 246),
                CRGB(75, 203, 246),

                CRGB(60, 60, 255),
                CRGB(60, 60, 255),
                CRGB(255, 0, 84),
                CRGB(255, 0, 84)),
  //custom palette 1
  CRGBPalette16(CRGB(255, 0, 0),
                CRGB(255, 0, 0),
                CRGB(255, 100, 100),
                CRGB(255, 100, 100),

                CRGB(160, 20, 255),
                CRGB(160, 20, 255),
                CRGB(255, 230, 40),
                CRGB(255, 230, 40),
                
                CRGB(255, 230, 40),
                CRGB(255, 230, 40),
                CRGB(160, 20, 255),
                CRGB(160, 20, 255),

                CRGB(255, 100, 100),
                CRGB(255, 100, 100),
                CRGB(255, 0, 0),
                CRGB(255, 0, 0)),
  //heat colors palette
  heat_colors            
};

/* sort the leds into rows and columns for easy addressing 
   there are 60 leds per channel for left and right,
   10 columns and 6 rows for each channel

*/
static uint8_t leds_arr[10][6];

//functions used to display numbers 
void zero(uint8_t lr, uint8_t pos){
  for(uint8_t i=0; i<5; i++){
    leds[lr][leds_arr[0+pos][i]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][i]] = CHSV(0,0,brightness);
  }
  leds[lr][leds_arr[1+pos][4]] = CHSV(0,0,brightness);
  leds[lr][leds_arr[1+pos][0]] = CHSV(0,0,brightness);
}

void one(uint8_t lr, uint8_t pos){

  for(uint8_t i=0; i<5; i++){
    leds[lr][leds_arr[1+pos][i]] = CHSV(0,0,brightness);
  }
}

