big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
void brightness_control(uint8_t choice){
  uint8_t *p_brightness = &brightness;
  switch(choice){
    //show brightness controls for case 0
    case 0:
      for(uint8_t i=0; i<2; i++){
        for(uint8_t j=0; j<10; j++){
          for(uint8_t k=0; k<6; k++){
            leds[i][leds_arr[j][k]]=CRGB(0,0,0);
          }
      }
      }
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[0][leds_arr[l][m]] =CHSV(0,0,brightness);
          leds[1][leds_arr[l][m]] =CHSV(0,0,brightness);
        }
      }
      for(uint8_t n=4; n<6; n++){
        for(uint8_t o=0; o<6; o++){
          leds[1][leds_arr[n][o]] = CHSV(0,0,brightness);
        }
      }
      FastLED.show();
      break;
    // increase brigtness by 1 and show brightness value `on the left
    case 1:
      brightness +=2;
      if(brightness>max_brightness){
        brightness = max_brightness;
      }
      clear_leds(1);
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[1][leds_arr[l][m]] = CHSV(0,0,brightness);
        }
      }
      for(uint8_t n=4; n<6; n++){
        for(uint8_t o=0; o<6; o++){
          leds[1][leds_arr[n][o]] = CHSV(0,0,brightness);
        }
      }
      number_display(true);
      EEPROM.write(0, brightness);
      EEPROM.commit();
      break;
    // decrease brightness by 2 and show brighness value on the right.
    case 2:
      brightness -=2;
      if (brightness<min_brightness){
        brightness = min_brightness;
      }
      clear_leds(0);
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[0][leds_arr[l][m]] =CHSV(0,0,brightness);
        }
      }
      number_display(false);
      EEPROM.write(0, brightness);
      EEPROM.commit();
      break;
  }
}

void mode_animation(uint8_t animation_choice){
  uint8_t mode1_column_heights[10] = {1,2,3,4,5,5,4,3,2,1};
  switch (animation_choice){
  case 1:
    //start wave frame timer for mode 1 animation
    if(wave_frame_timer_flag == false){
      xTimerStart(wave_frame_timer,0);
      wave_frame_timer_flag =true;
      Serial.println("wave frame timer started");
    }
    if(shift_frame){
      shift_frame = false;
      column_height[1][0] = mode1_column_heights[mode1_column_index];
      for(uint8_t i=0; i<column_height[1][0]; i++){
        leds[1][leds_arr[0][i]] = ColorFromPalette(palettes_arr[2],hue, brightness, LINEARBLEND);
      }
      for(uint8_t i=5; i>column_height[1][0]; i--){
        leds[1][leds_arr[0][i]] = CRGB(0,0,0);
      }
      for(uint8_t i=9; i>0; i-- ){
        column_height[1][i] = column_height[1][i-1];
      }
      for(uint8_t i=1; i<10; i++){
        for(uint8_t j=0; j<column_height[1][i]; j++){
          leds[1][leds_arr[i][j]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        }
        for(uint8_t k=5; k>column_height[1][i]; k--){
          leds[1][leds_arr[i][k]] = CRGB(0,0,0);
        }
      }
      mode1_column_index +=1;
      if(mode1_column_index >9){
        mode1_column_index = 0;
      }
    }
  break;
  
  case 0:
    // periodically generate random peak column heights based on the mode_animation_random_timer
    if(mode_animation_random_on){
      for(uint8_t i=0; i<10; i++){
        peak_column_height[1][i] = random8(2,6);
      }
      mode_animation_random_on = false;
    }
    if(mode_animation_random_timer_flag == false){
      xTimerStart(mode_animation_random_timer,0);
      mode_animation_random_timer_flag = true;
    }
    for(uint8_t i=0; i<10; i++){
      for(uint8_t j=0; j<peak_column_height[1][i]; j++){
        leds[1][leds_arr[i][j]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      for(uint8_t k=5; k>peak_column_height[1][i]; k--){
        leds[1][leds_arr[i][k]] = CRGB(0,0,0);
      }
    }
    
  break;
  default:
    break;
  }
  vTaskDelay(10/portTICK_PERIOD_MS);
  nblendPaletteTowardPalette(palettes_arr[2],palettes_arr[palette_index],70);
  FastLED.show();
}
void mode_palette_control(uint8_t choice){
  switch (choice)
  {
  case 0:
   
    for(uint8_t j=0; j<10; j++){
      if(j == 9 or j == 7 or j == 6 or j == 4 or j== 3){
      for(uint8_t i=0; i<5; i++){
        leds[0][leds_arr[j][i]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(j == 8){
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 5 or j == 2){
        leds[0][leds_arr[j][4]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][0]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 1){
        leds[0][leds_arr[j][1]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][2]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
    }  

    for(uint8_t i=0; i<10; i++){
      if(i == 0 or i == 6){
        for(uint8_t j=0; j<5; j++){
          leds[1][leds_arr[i][j]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(i == 1){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 2){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 3 or i == 5){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][1]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 4){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i ==7 or i == 8){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
    }

  break;
  
  case 1:
    // display words "mod" at the left 
    for(uint8_t j=0; j<10; j++){
      if(j == 9 or j == 7 or j == 6 or j == 4 or j== 3){
      for(uint8_t i=0; i<5; i++){
        leds[0][leds_arr[j][i]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(j == 8){
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 5 or j == 2){
        leds[0][leds_arr[j][4]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][0]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 1){
        leds[0][leds_arr[j][1]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][2]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
    }  
  break;

  default:
    break;
  }
  nblendPaletteTowardPalette(palettes_arr[2],palettes_arr[palette_index],70);
  FastLED.show();
}
void timer1_callback(TimerHandle_t pxTimer){
  timer1_started = true;
  brightness_control(0);
  brightness_control_flag = false;
  Serial.println("timer1 tick");
}

