big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
void timer3_callback(TimerHandle_t pxTimer){
  timer3_started = true;
  brightness_control(1);
  Serial.println("timer 3 tick");
}

void timer2_callback(TimerHandle_t pxTimer){
  timer2_started = true;
  brightness_control(2);
  Serial.println("timer 2 tick");
}

uint8_t touch_reader(){
  uint_fast8_t bin1, bin2, bin3;
  uint_fast8_t touch_out;
  if (touchRead(touch1)<=40){
    bin1 = B100;
    if(touch1_letgo){
      touch1_time = millis();
      touch1_letgo = false;
      short_press1 = true;
      long_press1 = true;
    }
  }
  else{
    bin1 = B0;
    touch1_letgo = true;
  }
  if(touchRead(touch2)<=40){
    bin2 = B010;
    if(touch2_letgo){
      touch2_time = millis();
      touch2_letgo = false;
      short_press2 = true;
      long_press2 = true;
    }
  }
  else{
    bin2 = B0;
    touch2_letgo = true;
  }
  if(touchRead(touch3)<40){
    bin3 = B001;
    if(touch3_letgo){
      touch3_time = millis();
      touch3_letgo = false;
      short_press3 = true;
      long_press3 = true;
    }
  }
  else{
    bin3 = B0;
    touch3_letgo = true;
  }
  touch_out = bin1 + bin2 + bin3;
  return touch_out;
}

void touch_func(void* parameters){
  uint8_t touch_reading;
  uint8_t first_touch_val;
  bool first_touch_flag = true;
  bool suspend_flag = true;
  bool white_lights = false;
  bool speaker_on = true;

  while(1){
    if(first_touch_flag ==true and touch_reader()>0){
      // raise priority of first touch func when touch is detected
      vTaskPrioritySet(NULL, 2);
      Serial.println("touch func priority raised");
      first_touch_val = touch_reader();
      first_touch_flag = false;
      Serial.print("first touch val: ");
      Serial.println(first_touch_val,BIN);

      // suspend all passive tasks when touch is detected
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(wave_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      Serial.println("all passive tasks suspended");
    }
    // choose which menu to enter based on which button was touched first
    switch (first_touch_val){
    case B100:
      //brightness controls
      touch_reading = touch_reader();
      switch (touch_reading){
        case B100:
          //if brightness was changed before coming here, wait 3 seconds before showing default -+ menu
          if (brightness_control_flag == true){
            if(timer1_started == false){
              xTimerStart(touch1_timer,0);
              timer1_started = true;
              Serial.println("timer1 started");
            }
            // stop timer 2 and timer 3 to stop brightness value from incrementing periodically
            if(timer2_started){
              xTimerStop(touch2_timer,0);
              timer2_started = false;
            }
            if(timer3_started){
              xTimerStop(touch3_timer,0);
              timer3_started = false;
            }
          }
          else{
            brightness_control(0);
          }
        break;
          
        case B101:
        // + brightness
          if (timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
            Serial.println("timer1 stopped");
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(short_press3){
            brightness_control(1);
            short_press3 = false;
            Serial.println("short press 3");
          }
          // increntment brightness every 200ms after touch3 has been touched over 1 second
          if(millis()-touch3_time>=1000){
            if(timer3_started == false){
              timer3_started = true;
              xTimerStart(touch3_timer, 0);
            }
          }
          brightness_control_flag = true;
        break;

        case B110:
        // - brightness
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
            Serial.println("timer 1 stopped");
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started =false;
          }
          if(short_press2){
            brightness_control(2);
            short_press2 = false;
            Serial.println("short press 2");
          }
          // decrease brightness every 200ms after touch3 has been touched over 1 second
          if(millis()-touch2_time>=1000){
            if(timer2_started == false){
              timer2_started = true;
              xTimerStart(touch2_timer, 0);
              Serial.println(brightness);
            }
          }
          brightness_control_flag = true;
        break;

        default:
          Serial.println("exit first_touch B100 menu");
          // stop all timers used in brightness controls before exiting
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started = false;
          }
          // if white lights are on, continue displaying white lights after exiting brightness controls
          if(white_lights){
            fill_white_lights();
          }
          brightness_control_flag = false;
          //allow the first touch value to be changed to enter other menus
          first_touch_val = 0;
          first_touch_flag = true;
        break;
      }
    break;

    case B010:
      //mode and palette controls
      touch_reading = touch_reader();
      // disable mode and palette controls when white lights are on
      if(white_lights){
        Serial.println("white lights enabled mode and pal controls disabled");
        first_touch_val = 0;
        first_touch_flag = true;
        break;
      }
      // speed up palette hue increment in menu to view palettes better
      if(hue_timer_change_peiod_flag == false){
        xTimerChangePeriod(hue_timer, pdMS_TO_TICKS(20), 0);
        hue_timer_change_peiod_flag = true;
      }
      switch (touch_reading)
      {
      case B010:
        // only update the left led array when the mode animation is running
        if(mode_animation_started){
          mode_palette_control(1);
          mode_animation(current_mode);
        }
        else{
          //show mode palette controls when no animation is running
           if(initial_clear == false){
            clear_leds(0);
            clear_leds(1);
            initial_clear = true;
          }
          mode_palette_control(0);
        }
      break;
      
      case B110:
        //mode change 
        if(short_press1){
          short_press1 = false;
          current_mode += 1;
          if(current_mode >= 2){
            current_mode = 0;
          }

          EEPROM.write(1, current_mode);
          EEPROM.commit();

          Serial.print("current mode: ");
          Serial.println(current_mode);
          // start mode animation if not started yet
          if (mode_animation_started == false){
            xTimerStart(mode_animation_timer, 0);
            mode_animation_started = true;
            Serial.println("mode animation started");
          }
          //reset the mode animation timer every time a mode is changed
          xTimerReset(mode_animation_timer,0);
        }
        /*run the mode_animation function while mode animation function is true
          mode_animation_started will become false once it times out */
        if(mode_animation_started){
          mode_animation(current_mode);
          // constantly update the left led array while animating modes for a smooth effect
          mode_palette_control(1);
        }
        //show mode palette controls when animation times out
        if(mode_animation_started == false){
          if(initial_clear == false){
            clear_leds(1);
            initial_clear = true;
          }
          mode_palette_control(0);
          Serial.println("showing mode palette controls from mode change");
        }
        
      break;

      case B011:
        if(short_press3){
          short_press3 = false;
          if(palette_index<3){
            palette_index +=1;
          }
          else{
            palette_index = 0;
          }
          EEPROM.write(2, palette_index);
          EEPROM.commit();
          Serial.print("palette index: ");
          Serial.println(palette_index);
        }
        //if animation is running, only update the left led array
        
        if(mode_animation_started == true){
          mode_palette_control(1);
          mode_animation(current_mode);
        }
        else{
          mode_palette_control(0);
        }
      break;

      default:
        Serial.println("exit first touch B010 menu");
        first_touch_val = 0;
        first_touch_flag = true;
        initial_clear = false;
        if(mode_animation_started){
          mode_animation_started = false;
          xTimerStop(mode_animation_timer,0);
          Serial.println("mode animation stopped");
        }
        //change the hue increment timer back to original after closing mode and palette menu
        if(hue_timer_change_peiod_flag == true){
          xTimerChangePeriod(hue_timer, pdTICKS_TO_MS(80), 0);
          hue_timer_change_peiod_flag = false;
        }
 
      break;
      }
    break;

    case B001:
      //white lights and speaker on off controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(wave_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading){
        case B111:
          //turn of visualizer for white light, touch and hold longer to turn of speaker amplifier but keep lights on
          if (millis()-touch1_time<3000 and millis()-touch2_time<3000){
              if(short_press1 and short_press2 and short_press3){
                short_press1 = short_press2 = short_press3 = false;
                white_lights = !white_lights;
                if(white_lights){
                  vTaskDelay(1);
                  fill_white_lights();
                  Serial.println("white light on"); 
                }
                else{
                  Serial.println("white light off");
                }
              }
          }
          if (millis()-touch1_time>3000 and millis()-touch2_time>3000){
            if(long_press1 and long_press2 and long_press3){
              long_press1 = long_press2 = long_press3 = false;
              speaker_on = !speaker_on;
              Serial.println("toggle speakers");
              if(speaker_on){
                digitalWrite(relay_pin,LOW);
                Serial.println("speaker_on");
              }
              if(speaker_on != true){
                digitalWrite(relay_pin,HIGH);
                Serial.println("speaker off");
              }
            }
          }
        break;

